Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: For example, to change your `extDiff` and `extMerge` tools to run the KDiff3 tool instead, all you have to do is edit your `extMerge` file:
cs: Chcete-li například změnit nástroje `extDiff` a `extMerge`, aby se místo nich spouštěl nástroj KDiff3, jediné, co musíte udělat, je upravit soubor `extMerge`:

source: For example, to clone a local repository, you can run something like this:
cs: K naklonování lokálního repozitáře můžete použít příkaz například v tomto tvaru:

source: For example, to correct the usability problem you encountered with unstaging a file, you can add your own unstage alias to Git:
cs: Pokud jste například narazili na problém s používáním příkazu pro vrácení souboru z oblasti připravených změn, můžete ho vyřešit přidáním vlastního aliasu:

source: For example, to modify only the third commit message, you change the file to look like this:
cs: Chcete-li například změnit pouze zprávu ke třetí revizi, změňte soubor následovně:

source: For example, to see a specific commit, suppose you run a `git log` command and identify the commit where you added certain functionality:
cs: Pokud si chcete například prohlédnout konkrétní revizi, řekněme, že spustíte příkaz `git log` a určíte revizi, do níž jste vložili určitou funkci:

source: For example, to set the meta information in your diff output to blue foreground, black background, and bold text, you can run
cs: Budete-li chtít nastavit například meta informace ve výpisu příkazu diff tak, aby měly modré popředí, černé pozadí a tučné písmo, můžete použít příkaz:

source: For example, you can do some simple version control on a file.
cs: Na souboru můžete například provádět jednoduché verzování.

source: For example, you can get the manpage help for the config command by running
cs: Například manpage nápovědu pro příkaz `config` vyvoláte zadáním:

source: For example, you can get the same results as in the previous example by typing `git log origin/master..` — Git substitutes HEAD if one side is missing.
cs: Stejné výsledky jako v předchozím příkladu dostanete zadáním příkazu `git log origin/master..` – Git dosadí na prázdnou stranu výraz HEAD.

source: For example, you can start a branch named `recover-branch` at that commit (ab1afef):
cs: Na revizi můžete vytvořit například větev `recover-branch` (ab1afef):

source: For example, you’ll import the Jam project from the Perforce Public Depot.
cs: Budete chtít například importovat projekt Jam z veřejného úložiště Perforce Public Depot.

source: For example:
cs: Například takto:

source: For future projects, you can also copy collaborator groups by copying the permissions of an existing project.
cs: U budoucích projektů budete také moci zkopírovat skupinu spolupracovníků zkopírováním oprávnění z existujícího projektu.

source: For instance, Xcode projects on the Mac contain a file that ends in `.pbxproj`, which is basically a JSON (plain text javascript data format) dataset written out to disk by the IDE that records your build settings and so on.
cs: Například projekty Xcode v systémech Mac obsahují soubory končící na `.pbxproj`, což je v podstatě sada dat JSON (datový formát prostého textu javascript) zapsaná na disk nástrojem IDE, který zaznamenává vaše nastavení atd.

source: For instance, if Jessica sends you an e-mail saying that she has a great new feature in the `ruby-client` branch of her repository, you can test it by adding the remote and checking out that branch locally:
cs: Pokud vám tedy například Jessica pošle e-mail, že vytvořila skvělou novou funkci ve větvi `ruby-client` ve svém repozitáři, můžete funkci otestovat tak, že přidáte větev jako vzdálenou a provedete její lokální checkout:

source: For instance, if Jessica wants to send John a pull request, and she’s done two commits on the topic branch she just pushed up, she can run this:
cs: Pokud chce například Jessica poslat Johnovi žádost o natažení a vytvořila předtím dvě revize v tematické větvi, kterou právě odeslala, může zadat tento příkaz:

source: For instance, if a documentation author tries to push a commit modifying something in the `lib` directory, they see
cs: Pokud se například autor dokumentace pokusí odeslat revizi, která mění obsah adresáře `lib`, zobrazí se mu upozornění:

source: For instance, if you want the `iphone_project` to show up on GitWeb, you make the `repo` setting look like this:
cs: Pokud například chcete, aby GitWeb zobrazoval `iphone_project`, upravíte nastavení `repo` do této podoby:

source: For instance, if you want to include a file named `LAST_COMMIT` in your project, and the last commit date was automatically injected into it when `git archive` ran, you can set up the file like this:
cs: Chcete-li do projektu zahrnout například soubor s názvem `LAST_COMMIT` a při spuštění příkazu `git archive` do něj bylo automaticky vloženo datum poslední revize, můžete nastavit tento soubor takto:

source: For instance, if you want to rename `pb` to `paul`, you can do so with `git remote rename`:
cs: Pokud například chcete přejmenovat repozitář z `pb` na `paul`, můžete tak učinit příkazem `git remote rename`:

source: For instance, if you want to see all commits that are reachable from `refA` or `refB` but not from `refC`, you can type one of these:
cs: Pokud chcete zobrazit například všechny revize, které jsou dostupné ve větvi `refA` nebo `refB`, ale nikoli ve větvi `refC`, zadejte jeden z následujících příkazů:

source: For instance, if you want to show the last commit object on a branch, the following commands are equivalent, assuming that the `topic1` branch points to `ca82a6d`:
cs: Pokud chcete například zobrazit objekt poslední revize větve, můžete využít některý z následujících příkazů (za předpokladu, že větev `topic1` ukazuje na `ca82a6d`):

source: For instance, if you wanted to see what the `master` branch on your `origin` remote looked like as of the last time you communicated with it, you would check the `origin/master` branch.
cs: Pokud například chcete zjistit, jak vypadala větev `master` na vašem vzdáleném serveru `origin`, když jste s ní naposledy komunikovali, budete hledat větev `origin/master`.

source: For instance, if you’re running a `git log` command and can’t remember one of the options, you can start typing it and press Tab to see what matches:
cs: Pokud například zadáváte příkaz `git log` a nemůžete si vzpomenout na některý z parametrů, můžete zadat jeho začátek, stisknout klávesu Tab a podívat se, co by to mohlo přesně být:

source: For instance, if you’re updating the `master` branch and adding an `experiment` branch, the `send-pack` response may look something like this:
cs: Pokud například aktualizujete větev `master` a přidáváte větev `experiment`, odpověď procesu `send-pack` může mít následující podobu:

source: For instance, some text files may be machine generated and not diffable, whereas some binary files can be diffed — you’ll see how to tell Git which is which.
cs: Některé textové soubory mohou být například vygenerovány strojově a nelze na ně aplikovat nástroj diff, zatímco na jiné binární soubory lze. Ukážeme si, jak systému Git sdělit, které jsou které.

source: For instance, suppose you create a template file at `$HOME/.gitmessage.txt` that looks like this:
cs: Řekněme, například, že vytvoříte soubor šablony `$HOME/.gitmessage.txt`, který bude vypadat takto:

source: For instance, the Linux kernel recently jumped from 8 to 10 characters to ensure SHA-1 object uniqueness, so older `git describe` output names were invalidated.
cs: Například jádro Linuxu nyní přešlo z 8 na 10 znaků, aby byla zajištěna jedinečnost objektů SHA-1. Starší výstupy příkazu `git describe` proto už nebudou platné.

source: For instance, to see where your `master` branch was yesterday, you can type
cs: Chcete-li například zjistit, kde byla vaše větev `master` včera (yesterday), můžete zadat příkaz:

source: For instance, you can add a remote called `origin` and push your `master` branch to it:
cs: Můžete například přidat vzdálený repozitář `origin` a odeslat do něj větev `master`:

source: For instance, you might resolve this conflict by replacing the entire block with this:
cs: Tento konflikt můžete vyřešit například nahrazením celého bloku tímto textem:

source: For many years, this has been the standard for version control (see Figure 1-2).
cs: Tento koncept byl dlouhá léta standardem pro správu verzí (viz obrázek 1-2).

source: For more information about the differences in efficiency between the HTTP protocol and the other protocols, see Chapter 9.
cs: Více informací o rozdílech ve výkonnosti mezi protokolem HTTP a ostatními protokoly najdete v kapitole 9.

source: For most of the lifetime of the Linux kernel maintenance (1991–2002), changes to the software were passed around as patches and archived files.
cs: V letech 1991 — 2002 bylo jádro Linuxu spravováno formou záplat a archivních souborů.

source: For now, move the `authorized_keys` file out of the way:
cs: Pro tuto chvíli tedy odstraňte soubor `authorized_keys`:

source: For now, that is always `master`, which is the default; you won’t worry about it here.
cs: Pro tuto chvíli nebudeme situaci komplikovat a výchozí bude vždy hlavní větev (`master` branch).

source: For now, you’ve committed all your changes, so you can switch back to your master branch:
cs: Pro tuto chvíli jste zapsali všechny provedené změny a můžete přepnout zpět na hlavní větev:

source: For one thing, you should clean up the weird references that `git svn` set up.
cs: Zaprvé je nutné vyčistit podivné reference, které vytvořil příkaz `git svn`.

source: For public, unauthenticated read access to your projects, you’ll want to move past the HTTP protocol and start using the Git protocol.
cs: Jestliže potřebujete ke svým projektům přístup pro čtení bez ověřování totožnosti, budete muset obejít protokol HTTP a začít používat protokol Git.

source: For really large companies or projects, the number of developers could be in the thousands, with dozens or even hundreds of patches coming in each day.
cs: V opravdu velkých společnostech a u velkých projektů se může počet vývojářů vyšplhat do tisíců a počet revizí se může pohybovat v desítkách i stovkách záplat denně.

source: For security reasons, it is strongly encouraged to have this daemon run as a user with read-only permissions to the repositories — you can easily do this by creating a new user 'git-ro' and running the daemon as them.
cs: Z bezpečnostních důvodů důrazně doporučujeme, aby byl tento démon spuštěn jako uživatel, který má k repozitářům oprávnění pouze pro čtení. To lze snadno zajistit vytvořením nového uživatele 'git-ro' a spuštěním démona v jeho roli.

source: For the sake of simplicity we’ll simply run it as the same 'git' user that Gitosis is running as.
cs: My ho pro zjednodušení spustíme jako uživatele 'git', kterého už využívá nástroj Gitosis.

source: For these tests, I created a new Subversion repository on Google code that was a partial copy of the `protobuf` project, which is a tool that encodes structured data for network transmission.
cs: Pro potřeby našich pokusů jsem na stránkách Google code vytvořil nový repozitář Subversion, který byl původně součástí kopie projektu `protobuf`, nástroje, který kóduje strukturovaná data pro síťový přenos.

source: Formatting and whitespace issues are some of the more frustrating and subtle problems that many developers encounter when collaborating, especially cross-platform.
cs: Chyby způsobené formátováním a prázdnými znaky jsou jedny z nejtitěrnějších a nejotravnějších problémů, s nimiž se vývojáři potýkají při vzájemné spolupráci, zvláště mezi různými platformami.

source: From now on, as long as that `update` script is there and executable, your repository will never be rewound and will never have a commit message without your pattern in it, and your users will be sandboxed.
cs: Od této chvíle budete mít k dispozici skript `update` ve spustitelné podobě, váš repozitář nikdy nebude převinut zpět a nikdy nepřijme zprávu k revizi, která by neodpovídala předepsanému vzoru. Uživatelé se navíc budou moci pohybovat jen ve vymezeném prostoru.

source: From that point forward, it should be called.
cs: Od tohoto okamžiku by měl být skript volán.

source: From the interactive prompt, type `5` or `p` (for patch).
cs: Na interaktivní výzvu zadejte příkaz `5` nebo `p` (jako „patch“ – tedy záplata).

source: Further paragraphs come after blank lines.
cs: Další odstavce se oddělují prázdným řádkem.

source: Furthermore, if the ref marker isn’t there in any of your commits, you’ll see the error message you’re printing out for that.
cs: Pokud navíc není ukazatel reference v některé z vašich revizí, zobrazí se chybové hlášení, které jste pro tento účel určili.

source: Furthermore, if you push this history back up to the server, you’ll reintroduce all those rebased commits to the central server, which can further confuse people.
cs: Pokud pak tuto historii odešlete zpět na server, znovu provedete všechny tyto přeskládané revize na centrálním serveru, což bude zmatečné i pro vaše spolupracovníky.

source: Furthermore, many of these systems deal pretty well with having several remote repositories they can work with, so you can collaborate with different groups of people in different ways simultaneously within the same project.
cs: Mnoho z těchto systémů navíc bez větších obtíží pracuje i s několika vzdálenými repozitáři, takže můžete v rámci jednoho projektu různým způsobem spolupracovat s různými skupinami lidí najednou.

source: Furthermore, what overall workflow do you want to use to maintain your project?
cs: A vůbec, jaký celkový pracovní postup zvolíte ke správě projektu?

source: Furthermore, you want your collaborators to be able to access the repository even if your computer is offline — having a more reliable common repository is often useful.
cs: Navíc chcete, aby měli vaši spolupracovníci do repozitáře přístup, i když je váš počítač vypnutý nebo odpojený – na společný repozitář bývá často lepší spolehnutí.

source: General sequence of events for a simple multiple-developer Git workflow.
cs: Obecná posloupnost kroků u jednoduchého pracovního postupu s více vývojáři v systému Git

source: Generally, eight to ten characters are more than enough to be unique within a project.
cs: Osm až deset znaků většinou bohatě stačí, aby byla hodnota v rámci projektu jednoznačná.

source: Generally, if you’re going to these lengths, it’s easier to use SSH public keys; but it may be a better solution in your specific case to use signed SSL certificates or other HTTP-based authentication methods for read-only access over HTTPS.
cs: Je pravda, že v takovém případě by už bylo jednodušší použít veřejné SSH klíče, ale ve vašem konkrétním případě může být použití podepsaných SSL certifikátů nebo jiné ověření identity na základě protokolu HTTP lepší metodou, jak zajistit přístup přes HTTPS pouze ke čtení.

source: Generally, people use this functionality to mark release points (`v1.0`, and so on).
cs: Tato funkce se nejčastěji používá k označení jednotlivých vydání (například `v1.0`).

source: Generally, this happens because you force-delete a branch that had work on it, and it turns out you wanted the branch after all; or you hard-reset a branch, thus abandoning commits that you wanted something from.
cs: Většinou k tomu dochází tak, že násilím smažete větev, která uchovávala část vaší práce, a vy po čase zjistíte, že byste tuto větev přece jen potřebovali. Stejně tak jste mohli provést tvrdý reset větve a tím zavrhnout revize, z nichž nyní něco potřebujete.

source: Generally, this script is used for notification or something similar.
cs: Tento skript se tak většinou používá pro účely oznámení a podobně.

source: Generally, you’ll pair it with SSH access for the few developers who have push (write) access and have everyone else use `git://` for read-only access.
cs: Protokol Git většinou využijete v kombinaci s přístupem přes SSH. Protokol SSH bude nastaven pro několik málo vývojářů s oprávněním k zápisu (odesílání dat) a všichni ostatní budou používat `git://` pro přístup pouze ke čtení.

source: Generally, you’ll type `y` or `n` if you want to stage each hunk, but staging all of them in certain files or skipping a hunk decision until later can be helpful too.
cs: Chcete-li připravit k zapsání jednotlivé komplexy, většinou zadáte `y` nebo `n`. Přesto se vám může někdy hodit i možnost připravit všechny komplexy v určitých souborech nebo přeskočení komplexu, k němuž se vrátíte později.

source: Get a writable copy of any repository by clicking the "fork" button.
cs: Zapisovatelnou kopii jakéhokoli repozitáře získáte kliknutím na tlačítko „fork“.

source: Getting in the habit of creating quality commit messages makes using and collaborating with Git a lot easier.
cs: Pokud si zvyknete vytvářet k revizím kvalitní zprávy, bude pro vás práce a kooperace v systému Git mnohem jednodušší.

source: Git OS X installer.
cs: Instalátor Git pro OS X

source: Git aborts the patch if this script exits non-zero.
cs: Je-li výstup tohoto skriptu nenulový, Git přeruší záplatu.

source: Git accepts kdiff3, tkdiff, meld, xxdiff, emerge, vimdiff, gvimdiff, ecmerge, and opendiff as valid merge tools.
cs: Jako platné nástroje slučování Git akceptuje: kdiff3, tkdiff, meld, xxdiff, emerge, vimdiff, gvimdiff, ecmerge a opendiff.

source: Git addresses this issue using submodules.
cs: Git nabízí jako řešení tohoto problému nástroj submodulů.

source: Git adds standard conflict-resolution markers to the files that have conflicts, so you can open them manually and resolve those conflicts.
cs: Git přidává ke kolidujícím souborům standardní značky pro označení konfliktů (conflict-resolution markers), takže soubor můžete ručně otevřít a konflikty vyřešit.

source: Git allows you to do this by using either the `^` character or `--not` before any reference from which you don’t want to see reachable commits.
cs: V systému Git to můžete provést buď zadáním znaku `^` nebo parametru `--not` před referencí, jejíž dostupné revize si nepřejete zobrazit.

source: Git allows you to specify specific commits or a range of commits in several ways.
cs: Systém Git umožňuje určit jednotlivé revize nebo interval revizí několika způsoby.

source: Git also doesn’t see any untracked files, or they would be listed here.
cs: Git také neví o žádných nesledovaných souborech, jinak by byly ve výčtu uvedeny.

source: Git also gives you your own `master` branch starting at the same place as origin’s `master` branch, so you have something to work from (see Figure 3-22).
cs: Git vám rovněž vytvoří vaši vlastní větev `master`, která bude začínat ve stejném místě jako větev `master` serveru `origin`. Máte tak definován výchozí bod pro svoji práci (viz obrázek 3-22).

source: Git also provides a couple of tools to help you debug issues in your projects.
cs: Git také nabízí několik nástrojů, které vám pomohou ladit problémy v projektech.

source: Git applies the last commit (`a5f4a0d`) in the script, and your history looks like this:
cs: Git aplikuje poslední revizi (`a5f4a0d`) ve skriptu. Vaše historie bude vypadat takto:

source: Git as a content-addressable filesystem is a very powerful tool that you can easily use as more than just a VCS.
cs: Git jakožto obsahově adresovatelný systém souborů je velmi výkonným nástrojem, který snadno využijete i k jiným účelům než jako pouhý systém VCS.

source: Git attribute data also allows you to do some interesting things when exporting an archive of your project.
cs: Data atributů Git umožňují rovněž některé zajímavé úkony při exportu archivů z vašeho projektu.

source: Git attributes offers you two ways to do this.
cs: Atributy Git nabízejí dvě možnosti, jak to provést.

source: Git automatically colors most of its output if you ask it to.
cs: Git na přání automaticky barevně zvýrazňuje většinu svých výstupů.

source: Git automatically creates a new commit object that contains the merged work.
cs: Git automaticky vytvoří nový objekt revize, který obsahuje sloučenou práci.

source: Git automatically expands the `serverfix` branchname out to `refs/heads/serverfix:refs/heads/serverfix`, which means, “Take my serverfix local branch and push it to update the remote’s serverfix branch.” We’ll go over the `refs/heads/` part in detail in Chapter 9, but you can generally leave it off.
cs: Git automaticky rozšíří název větve `serverfix` na `refs/heads/serverfix:refs/heads/serverfix`, což znamená: „Vezmi mou lokální větev `serverfix` a odešli ji na vzdálený server, kde aktualizuje tamní větev `serverfix`.“ Části `refs/heads/` se budeme podrobněji věnovat v kapitole 9, pro většinu uživatelů však nebude zajímavá.

source: Git automatically identifies the best common-ancestor merge base for branch merging.
cs: Git automaticky identifikuje nejvhodnějšího společného předka jako základnu pro sloučení větví.

source: Git can color its output to your terminal, which can help you visually parse the output quickly and easily.
cs: Git může výstup na vašem terminálu barevně zvýraznit a pomoci vám tak snadno a rychle se ve výpisu zorientovat.

source: Git can figure out a short, unique abbreviation for your SHA-1 values.
cs: Git dokáže identifikovat krátkou, jednoznačnou zkratku hodnoty SHA-1.

source: Git can handle this by auto-converting CRLF line endings into LF when you commit, and vice versa when it checks out code onto your filesystem.
cs: Git může tento problém vyřešit automatickou konverzí konců řádků CRLF na konce LF, jestliže zapisujete revizi, nebo obráceně, jestliže provádíte checkout zdrojového kódu do svého systému souborů.

source: Git can transfer data between two repositories in two major ways: over HTTP and via the so-called smart protocols used in the `file://`, `ssh://`, and `git://` transports.
cs: Git přenáší data mezi dvěma repozitáři dvěma základními způsoby: prostřednictvím protokolu HTTP a prostřednictvím takzvaných chytrých protokolů používaných při přenosu `file://`,`ssh://` a `git://`.

source: Git can use four major network protocols to transfer data: Local, Secure Shell (SSH), Git, and HTTP.
cs: Git může k přenosu dat používat jeden ze čtyř hlavních síťových protokolů: Local, Secure Shell (SSH), Git nebo HTTP.

source: Git checks for any listed alternates first:
cs: Git nejprve zjistí, zda jsou k dispozici alternativní repozitáře:

source: Git checks out a working copy of the `master` branch that was pointed to by the HEAD reference you downloaded at the beginning.
cs: Git provede checkout pracovní kopie větve `master`, na niž ukazovala reference HEAD, kterou jste stáhli na začátku.

source: Git comes preset to detect and fix some whitespace issues.
cs: Git je standardně nastaven na vyhledávání a opravu chyb způsobených prázdnými znaky.

source: Git comes preset to use a number of other merge-resolution tools without your having to set up the cmd configuration.
cs: Git je standardně přednastaven tak, aby dokázal používat celou řadu různých nástrojů k řešení konfliktů při slučování, aniž byste museli nastavovat konfiguraci příkazu.

source: Git comes with a CGI script called GitWeb that is commonly used for this.
cs: Git vám nabízí CGI skript s názvem GitWeb, který se k tomuto účelu běžně používá.

source: Git comes with a couple of scripts that make some command-line tasks easier.
cs: Git nabízí také celou řadu skriptů, které vám mohou usnadnit provádění příkazů zadávaných v příkazovém řádku.

source: Git comes with a tool called `git config` that lets you get and set configuration variables that control all aspects of how Git looks and operates.
cs: Nastavení konfiguračních proměnných systému, které ovlivňují jak vzhled systému Git, tak ostatní aspekty jeho práce, umožňuje příkaz `git config`.
